TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_dma1.h
/******************************************************************************
* DMA1 Register Control Bits
******************************************************************************/

/* DMA1_DMACTL Bits */
/* DMA1_DMACTL[DMAREQ] Bits */
#define DMA1_DMACTL_DMAREQ_OFS                   (0)                             /* !< DMAREQ Offset */
#define DMA1_DMACTL_DMAREQ_MASK                  ((uint32_t)0x00000001U)         /* !< DMA request. Software-controlled
                                                                                    DMA start. DMAREQ is reset
                                                                                    automatically. */
#define DMA1_DMACTL_DMAREQ_IDLE                  ((uint32_t)0x00000000U)         /* !< Default read value */
#define DMA1_DMACTL_DMAREQ_REQUEST               ((uint32_t)0x00000001U)         /* !< DMA transfer request (start DMA) */
/* DMA1_DMACTL[DMAEN] Bits */
#define DMA1_DMACTL_DMAEN_OFS                    (1)                             /* !< DMAEN Offset */
#define DMA1_DMACTL_DMAEN_MASK                   ((uint32_t)0x00000002U)         /* !< DMA enable */
#define DMA1_DMACTL_DMAEN_DISABLE                ((uint32_t)0x00000000U)         /* !< DMA channel disabled */
#define DMA1_DMACTL_DMAEN_ENABLE                 ((uint32_t)0x00000002U)         /* !< DMA channel enabled */
/* DMA1_DMACTL[DMASRCWDTH] Bits */
#define DMA1_DMACTL_DMASRCWDTH_OFS               (8)                             /* !< DMASRCWDTH Offset */
#define DMA1_DMACTL_DMASRCWDTH_MASK              ((uint32_t)0x00000700U)         /* !< DMA source width. This bit selects
                                                                                    the source data width as a byte, half
                                                                                    word, word, long word or long-long
                                                                                    word. */
#define DMA1_DMACTL_DMASRCWDTH_BYTE              ((uint32_t)0x00000000U)         /* !< Source data width is BYTE (8-bit) */
#define DMA1_DMACTL_DMASRCWDTH_HALF              ((uint32_t)0x00000100U)         /* !< Source data width is HALF-WORD
                                                                                    (16-bit) */
#define DMA1_DMACTL_DMASRCWDTH_WORD              ((uint32_t)0x00000200U)         /* !< Source data width is WORD (32-bit) */
#define DMA1_DMACTL_DMASRCWDTH_LONG              ((uint32_t)0x00000300U)         /* !< Source data width is LONG-WORD
                                                                                    (64-bit) */
#define DMA1_DMACTL_DMASRCWDTH_LONGLONG          ((uint32_t)0x00000400U)         /* !< Source data width is LONG-LONG-WORD
                                                                                    (128-bit) */
/* DMA1_DMACTL[DMADSTWDTH] Bits */
#define DMA1_DMACTL_DMADSTWDTH_OFS               (12)                            /* !< DMADSTWDTH Offset */
#define DMA1_DMACTL_DMADSTWDTH_MASK              ((uint32_t)0x00007000U)         /* !< DMA destination width. This bit
                                                                                    selects the destination as a byte,
                                                                                    half word, word, long word or
                                                                                    long-long word. */
#define DMA1_DMACTL_DMADSTWDTH_BYTE              ((uint32_t)0x00000000U)         /* !< Destination data width is BYTE
                                                                                    (8-bit) */
#define DMA1_DMACTL_DMADSTWDTH_HALF              ((uint32_t)0x00001000U)         /* !< Destination data width is HALF-WORD
                                                                                    (16-bit) */
#define DMA1_DMACTL_DMADSTWDTH_WORD              ((uint32_t)0x00002000U)         /* !< Destination data width is WORD
                                                                                    (32-bit) */
#define DMA1_DMACTL_DMADSTWDTH_LONG              ((uint32_t)0x00003000U)         /* !< Destination data width is LONG-WORD
                                                                                    (64-bit) */
#define DMA1_DMACTL_DMADSTWDTH_LONGLONG          ((uint32_t)0x00004000U)         /* !< Source data width is LONG-LONG-WORD
                                                                                    (128-bit) */
/* DMA1_DMACTL[DMASRCINCR] Bits */
#define DMA1_DMACTL_DMASRCINCR_OFS               (16)                            /* !< DMASRCINCR Offset */
#define DMA1_DMACTL_DMASRCINCR_MASK              ((uint32_t)0x000F0000U)         /* !< DMA source increment. This bit
                                                                                    selects automatic incrementing or
                                                                                    decrementing of the source address
                                                                                    DMASA for each transfer. The amount
                                                                                    of change to the DMASA is based on
                                                                                    the definitin in the DMASRCWDTH. For
                                                                                    example an increment of 1 (+1) on a
                                                                                    WORD transfer will increment the
                                                                                    DMASA by 4. */
#define DMA1_DMACTL_DMASRCINCR_UNCHANGED         ((uint32_t)0x00000000U)         /* !< Address is unchanged (+0) */
#define DMA1_DMACTL_DMASRCINCR_DECREMENT         ((uint32_t)0x00020000U)         /* !< Decremented by 1 (-1 * DMASRCWDTH) */
#define DMA1_DMACTL_DMASRCINCR_INCREMENT         ((uint32_t)0x00030000U)         /* !< Incremented by 1 (+1 * DMASRCWDTH) */
#define DMA1_DMACTL_DMASRCINCR_STRIDE_2          ((uint32_t)0x00080000U)         /* !< Stride size 2 (+2 * DMASRCWDTH) */
#define DMA1_DMACTL_DMASRCINCR_STRIDE_3          ((uint32_t)0x00090000U)         /* !< Stride size 3 (+3 * DMASRCWDTH) */
#define DMA1_DMACTL_DMASRCINCR_STRIDE_4          ((uint32_t)0x000A0000U)         /* !< Stride size 4 (+4 * DMASRCWDTH) */
#define DMA1_DMACTL_DMASRCINCR_STRIDE_5          ((uint32_t)0x000B0000U)         /* !< Stride size 5 (+5 * DMASRCWDTH) */
#define DMA1_DMACTL_DMASRCINCR_STRIDE_6          ((uint32_t)0x000C0000U)         /* !< Stride size 6 (+6 * DMASRCWDTH) */
#define DMA1_DMACTL_DMASRCINCR_STRIDE_7          ((uint32_t)0x000D0000U)         /* !< Stride size 7 (+7 * DMASRCWDTH) */
#define DMA1_DMACTL_DMASRCINCR_STRIDE_8          ((uint32_t)0x000E0000U)         /* !< Stride size 8 (+8 * DMASRCWDTH) */
#define DMA1_DMACTL_DMASRCINCR_STRIDE_9          ((uint32_t)0x000F0000U)         /* !< Stride size 9 (+9 * DMASRCWDTH) */
/* DMA1_DMACTL[DMADSTINCR] Bits */
#define DMA1_DMACTL_DMADSTINCR_OFS               (20)                            /* !< DMADSTINCR Offset */
#define DMA1_DMACTL_DMADSTINCR_MASK              ((uint32_t)0x00F00000U)         /* !< DMA destination increment. This bit
                                                                                    selects automatic incrementing or
                                                                                    decrementing of the destination
                                                                                    address DMADA for each transfer. The
                                                                                    amount of change to the DMADA is
                                                                                    based on the definitin in the
                                                                                    DMADSTWDTH. For example an increment
                                                                                    of 1 (+1) on a WORD transfer will
                                                                                    increment the DMADA by 4. */
#define DMA1_DMACTL_DMADSTINCR_UNCHANGED         ((uint32_t)0x00000000U)         /* !< Address is unchanged (+0) */
#define DMA1_DMACTL_DMADSTINCR_DECREMENT         ((uint32_t)0x00200000U)         /* !< Decremented by 1 (-1 * DMADSTWDTH) */
#define DMA1_DMACTL_DMADSTINCR_INCREMENT         ((uint32_t)0x00300000U)         /* !< Incremented by 1 (+1 * DMADSTWDTH) */
#define DMA1_DMACTL_DMADSTINCR_STRIDE_2          ((uint32_t)0x00800000U)         /* !< Stride size 2 (+2 * DMADSTWDTH) */
#define DMA1_DMACTL_DMADSTINCR_STRIDE_3          ((uint32_t)0x00900000U)         /* !< Stride size 3 (+3 * DMADSTWDTH) */
#define DMA1_DMACTL_DMADSTINCR_STRIDE_4          ((uint32_t)0x00A00000U)         /* !< Stride size 4 (+4 * DMADSTWDTH) */
#define DMA1_DMACTL_DMADSTINCR_STRIDE_5          ((uint32_t)0x00B00000U)         /* !< Stride size 5 (+5 * DMADSTWDTH) */
#define DMA1_DMACTL_DMADSTINCR_STRIDE_6          ((uint32_t)0x00C00000U)         /* !< Stride size 6 (+6 * DMADSTWDTH) */
#define DMA1_DMACTL_DMADSTINCR_STRIDE_7          ((uint32_t)0x00D00000U)         /* !< Stride size 7 (+7 * DMADSTWDTH) */
#define DMA1_DMACTL_DMADSTINCR_STRIDE_8          ((uint32_t)0x00E00000U)         /* !< Stride size 8 (+8 * DMADSTWDTH) */
#define DMA1_DMACTL_DMADSTINCR_STRIDE_9          ((uint32_t)0x00F00000U)         /* !< Stride size 9 (+9 * DMADSTWDTH) */
/* DMA1_DMACTL[DMATM] Bits */
#define DMA1_DMACTL_DMATM_OFS                    (28)                            /* !< DMATM Offset */
#define DMA1_DMACTL_DMATM_MASK                   ((uint32_t)0x30000000U)         /* !< DMA transfer mode register  Note:
                                                                                    The repeat-single (2h) and
                                                                                    repeat-block (3h) transfer are only
                                                                                    available in a FULL-channel
                                                                                    configuration. Please consult the
                                                                                    datasheet of the specific device to
                                                                                    map which channel number has FULL or
                                                                                    BASIC capability. In a BASIC channel
                                                                                    configuration only the values for
                                                                                    single (0h) and block (1h) transfer
                                                                                    can be set. */
#define DMA1_DMACTL_DMATM_SINGLE                 ((uint32_t)0x00000000U)         /* !< Single transfer. Each transfers
                                                                                    requires a new trigger. When the
                                                                                    DMASZ counts down to zero an event
                                                                                    can be generated and the DMAEN is
                                                                                    cleared. */
#define DMA1_DMACTL_DMATM_BLOCK                  ((uint32_t)0x10000000U)         /* !< Block transfer. Each trigger
                                                                                    transfers the complete block defined
                                                                                    in DMASZ. After the transfer is
                                                                                    complete an event can be generated
                                                                                    and the DMAEN is cleared. */
#define DMA1_DMACTL_DMATM_RPTSNGL                ((uint32_t)0x20000000U)         /* !< Repeated single transfer. Each
                                                                                    transfers requires a new trigger.
                                                                                    When the DMASZ counts down to zero an
                                                                                    event can be generated. After the
                                                                                    last transfer the DMASA, DMADA, DAMSZ
                                                                                    registers are restored to its initial
                                                                                    value and the DMAEN stays enabled. */
#define DMA1_DMACTL_DMATM_RPTBLCK                ((uint32_t)0x30000000U)         /* !< Repeated block transfer. Each
                                                                                    trigger transfers the complete block
                                                                                    defined in DMASZ. After the last
                                                                                    transfer the DMASA, DMADA, DAMSZ
                                                                                    registers are restored to its initial
                                                                                    value and the DMAEN stays enabled. */
/* DMA1_DMACTL[DMAEM] Bits */
#define DMA1_DMACTL_DMAEM_OFS                    (24)                            /* !< DMAEM Offset */
#define DMA1_DMACTL_DMAEM_MASK                   ((uint32_t)0x03000000U)         /* !< DMA extended mode  Note: The
                                                                                    extended transfer modes are only
                                                                                    available in a FULL-channel
                                                                                    configuration. Please consult the
                                                                                    datasheet of the specific device to
                                                                                    map which channel number has FULL or
                                                                                    BASIC capability. In a BASIC channel
                                                                                    configuration this register is a
                                                                                    read-only register and reads 0x0. */
#define DMA1_DMACTL_DMAEM_NORMAL                 ((uint32_t)0x00000000U)         /* !< Normal mode is related to transfers
                                                                                    from SRC to DST */
#define DMA1_DMACTL_DMAEM_GATHERMODE             ((uint32_t)0x01000000U)         /* !< Gather mode will read a data from
                                                                                    an address table located at SA, and
                                                                                    the data is transfered to the DA */
#define DMA1_DMACTL_DMAEM_FILLMODE               ((uint32_t)0x02000000U)         /* !< Fill mode will copy the SA register
                                                                                    content as data to DA */
#define DMA1_DMACTL_DMAEM_TABLEMODE              ((uint32_t)0x03000000U)         /* !< Table mode will read an address and
                                                                                    data value from SA and write the data
                                                                                    to address */
/* DMA1_DMACTL[DMAPREIRQ] Bits */
#define DMA1_DMACTL_DMAPREIRQ_OFS                (4)                             /* !< DMAPREIRQ Offset */
#define DMA1_DMACTL_DMAPREIRQ_MASK               ((uint32_t)0x00000070U)         /* !< Enable an early IRQ event. This can
                                                                                    help software to react quicker to and
                                                                                    DMA done event or allows some
                                                                                    additional configuration before the
                                                                                    channel is complete.   Note: This
                                                                                    register is only available in a
                                                                                    FULL-channel configuration. Please
                                                                                    consult the datasheet of the specific
                                                                                    device to map which channel number
                                                                                    has FULL or BASIC capability. In a
                                                                                    BASIC configuration this register is
                                                                                    a read only value and always reads as
                                                                                    0x0. */
#define DMA1_DMACTL_DMAPREIRQ_PREIRQ_DISABLE     ((uint32_t)0x00000000U)         /* !< Pre-IRQ event disabled. */
#define DMA1_DMACTL_DMAPREIRQ_PREIRQ_1           ((uint32_t)0x00000010U)         /* !< Issure Pre-IRQ event when DMASZ=1 */
#define DMA1_DMACTL_DMAPREIRQ_PREIRQ_2           ((uint32_t)0x00000020U)         /* !< Issure Pre-IRQ event when DMASZ=2 */
#define DMA1_DMACTL_DMAPREIRQ_PREIRQ_4           ((uint32_t)0x00000030U)         /* !< Issure Pre-IRQ event when DMASZ=4 */
#define DMA1_DMACTL_DMAPREIRQ_PREIRQ_8           ((uint32_t)0x00000040U)         /* !< Issure Pre-IRQ event when DMASZ=8 */
#define DMA1_DMACTL_DMAPREIRQ_PREIRQ_32          ((uint32_t)0x00000050U)         /* !< Issure Pre-IRQ event when DMASZ=32 */
#define DMA1_DMACTL_DMAPREIRQ_PREIRQ_64          ((uint32_t)0x00000060U)         /* !< Issure Pre-IRQ event when DMASZ=64 */
#define DMA1_DMACTL_DMAPREIRQ_PREIRQ_HALF        ((uint32_t)0x00000070U)         /* !< Issure Pre-IRQ event when DMASZ
                                                                                    reached the half size point of the
                                                                                    original transfer size */
/* DMA1_DMACTL[DMAAUTOEN] Bits */
#define DMA1_DMACTL_DMAAUTOEN_OFS                (2)                             /* !< DMAAUTOEN Offset */
#define DMA1_DMACTL_DMAAUTOEN_MASK               ((uint32_t)0x0000000CU)         /* !< Automatic DMA channel enable on
                                                                                    DMASA, DMADA, DMASZ register write.
                                                                                    If channel is configured as SW
                                                                                    trigger (DMATCTL=0), the AUTOEN will
                                                                                    set the DMAEN and DMAREQ. If channel
                                                                                    is configured as HW trigger
                                                                                    (DMACTL!=0), the AUTOEN will only set
                                                                                    the DMAEN. */
#define DMA1_DMACTL_DMAAUTOEN_DISABLE            ((uint32_t)0x00000000U)         /* !< No automatic DMA enable */
#define DMA1_DMACTL_DMAAUTOEN_DMASA              ((uint32_t)0x00000004U)         /* !< Automatic DMA enable on DMASA
                                                                                    register write. */
#define DMA1_DMACTL_DMAAUTOEN_DMADA              ((uint32_t)0x00000008U)         /* !< Automatic DMA enable on DMADA
                                                                                    register write. */
#define DMA1_DMACTL_DMAAUTOEN_DMASZ              ((uint32_t)0x0000000CU)         /* !< Automatic DMA enable on DMASZ
                                                                                    register write. */

/* DMA1_DMASA Bits */
/* DMA1_DMASA[ADDR] Bits */
#define DMA1_DMASA_ADDR_OFS                      (0)                             /* !< ADDR Offset */
#define DMA1_DMASA_ADDR_MASK                     ((uint32_t)0xFFFFFFFFU)         /* !< DMA Channel Source Address */
#define DMA1_DMASA_ADDR_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define DMA1_DMASA_ADDR_MAXIMUM                  ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* DMA1_DMADA Bits */
/* DMA1_DMADA[ADDR] Bits */
#define DMA1_DMADA_ADDR_OFS                      (0)                             /* !< ADDR Offset */
#define DMA1_DMADA_ADDR_MASK                     ((uint32_t)0xFFFFFFFFU)         /* !< DMA Channel Destination Address */
#define DMA1_DMADA_ADDR_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define DMA1_DMADA_ADDR_MAXIMUM                  ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* DMA1_DMASZ Bits */
/* DMA1_DMASZ[SIZE] Bits */
#define DMA1_DMASZ_SIZE_OFS                      (0)                             /* !< SIZE Offset */
#define DMA1_DMASZ_SIZE_MASK                     ((uint32_t)0x0000FFFFU)         /* !< DMA Channel Size in number of
                                                                                    transfers */
#define DMA1_DMASZ_SIZE_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define DMA1_DMASZ_SIZE_MAXIMUM                  ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

