TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_dma1.h
/* DMA1_GEN_EVENT_RIS Bits */
/* DMA1_GEN_EVENT_RIS[DMACH0] Bits */
#define DMA1_GEN_EVENT_RIS_DMACH0_OFS            (0)                             /* !< DMACH0 Offset */
#define DMA1_GEN_EVENT_RIS_DMACH0_MASK           ((uint32_t)0x00000001U)         /* !< DMA Channel 0 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA1_GEN_EVENT_RIS_DMACH0_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA1_GEN_EVENT_RIS_DMACH0_SET            ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* DMA1_GEN_EVENT_RIS[DMACH1] Bits */
#define DMA1_GEN_EVENT_RIS_DMACH1_OFS            (1)                             /* !< DMACH1 Offset */
#define DMA1_GEN_EVENT_RIS_DMACH1_MASK           ((uint32_t)0x00000002U)         /* !< DMA Channel 1 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA1_GEN_EVENT_RIS_DMACH1_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA1_GEN_EVENT_RIS_DMACH1_SET            ((uint32_t)0x00000002U)         /* !< Interrupt occurred */
/* DMA1_GEN_EVENT_RIS[DMACH2] Bits */
#define DMA1_GEN_EVENT_RIS_DMACH2_OFS            (2)                             /* !< DMACH2 Offset */
#define DMA1_GEN_EVENT_RIS_DMACH2_MASK           ((uint32_t)0x00000004U)         /* !< DMA Channel 2 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA1_GEN_EVENT_RIS_DMACH2_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA1_GEN_EVENT_RIS_DMACH2_SET            ((uint32_t)0x00000004U)         /* !< Interrupt occurred */
/* DMA1_GEN_EVENT_RIS[DMACH3] Bits */
#define DMA1_GEN_EVENT_RIS_DMACH3_OFS            (3)                             /* !< DMACH3 Offset */
#define DMA1_GEN_EVENT_RIS_DMACH3_MASK           ((uint32_t)0x00000008U)         /* !< DMA Channel 3 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA1_GEN_EVENT_RIS_DMACH3_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA1_GEN_EVENT_RIS_DMACH3_SET            ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* DMA1_GEN_EVENT_RIS[DMACH4] Bits */
#define DMA1_GEN_EVENT_RIS_DMACH4_OFS            (4)                             /* !< DMACH4 Offset */
#define DMA1_GEN_EVENT_RIS_DMACH4_MASK           ((uint32_t)0x00000010U)         /* !< DMA Channel 4 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA1_GEN_EVENT_RIS_DMACH4_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA1_GEN_EVENT_RIS_DMACH4_SET            ((uint32_t)0x00000010U)         /* !< Interrupt occurred */
/* DMA1_GEN_EVENT_RIS[DMACH5] Bits */
#define DMA1_GEN_EVENT_RIS_DMACH5_OFS            (5)                             /* !< DMACH5 Offset */
#define DMA1_GEN_EVENT_RIS_DMACH5_MASK           ((uint32_t)0x00000020U)         /* !< DMA Channel 5 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA1_GEN_EVENT_RIS_DMACH5_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA1_GEN_EVENT_RIS_DMACH5_SET            ((uint32_t)0x00000020U)         /* !< Interrupt occurred */
/* DMA1_GEN_EVENT_RIS[DMACH6] Bits */
#define DMA1_GEN_EVENT_RIS_DMACH6_OFS            (6)                             /* !< DMACH6 Offset */
#define DMA1_GEN_EVENT_RIS_DMACH6_MASK           ((uint32_t)0x00000040U)         /* !< DMA Channel 6 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA1_GEN_EVENT_RIS_DMACH6_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA1_GEN_EVENT_RIS_DMACH6_SET            ((uint32_t)0x00000040U)         /* !< Interrupt occurred */
/* DMA1_GEN_EVENT_RIS[DMACH7] Bits */
#define DMA1_GEN_EVENT_RIS_DMACH7_OFS            (7)                             /* !< DMACH7 Offset */
#define DMA1_GEN_EVENT_RIS_DMACH7_MASK           ((uint32_t)0x00000080U)         /* !< DMA Channel 7 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA1_GEN_EVENT_RIS_DMACH7_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA1_GEN_EVENT_RIS_DMACH7_SET            ((uint32_t)0x00000080U)         /* !< Interrupt occurred */
/* DMA1_GEN_EVENT_RIS[DMACH8] Bits */
#define DMA1_GEN_EVENT_RIS_DMACH8_OFS            (8)                             /* !< DMACH8 Offset */
#define DMA1_GEN_EVENT_RIS_DMACH8_MASK           ((uint32_t)0x00000100U)         /* !< DMA Channel 8 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA1_GEN_EVENT_RIS_DMACH8_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA1_GEN_EVENT_RIS_DMACH8_SET            ((uint32_t)0x00000100U)         /* !< Interrupt occurred */
/* DMA1_GEN_EVENT_RIS[DMACH9] Bits */
#define DMA1_GEN_EVENT_RIS_DMACH9_OFS            (9)                             /* !< DMACH9 Offset */
#define DMA1_GEN_EVENT_RIS_DMACH9_MASK           ((uint32_t)0x00000200U)         /* !< DMA Channel 9 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA1_GEN_EVENT_RIS_DMACH9_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA1_GEN_EVENT_RIS_DMACH9_SET            ((uint32_t)0x00000200U)         /* !< Interrupt occurred */
/* DMA1_GEN_EVENT_RIS[DMACH10] Bits */
#define DMA1_GEN_EVENT_RIS_DMACH10_OFS           (10)                            /* !< DMACH10 Offset */
#define DMA1_GEN_EVENT_RIS_DMACH10_MASK          ((uint32_t)0x00000400U)         /* !< DMA Channel 10 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA1_GEN_EVENT_RIS_DMACH10_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA1_GEN_EVENT_RIS_DMACH10_SET           ((uint32_t)0x00000400U)         /* !< Interrupt occurred */
/* DMA1_GEN_EVENT_RIS[DMACH11] Bits */
#define DMA1_GEN_EVENT_RIS_DMACH11_OFS           (11)                            /* !< DMACH11 Offset */
#define DMA1_GEN_EVENT_RIS_DMACH11_MASK          ((uint32_t)0x00000800U)         /* !< DMA Channel 11 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA1_GEN_EVENT_RIS_DMACH11_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA1_GEN_EVENT_RIS_DMACH11_SET           ((uint32_t)0x00000800U)         /* !< Interrupt occurred */
/* DMA1_GEN_EVENT_RIS[PREIRQCH0] Bits */
#define DMA1_GEN_EVENT_RIS_PREIRQCH0_OFS         (16)                            /* !< PREIRQCH0 Offset */
#define DMA1_GEN_EVENT_RIS_PREIRQCH0_MASK        ((uint32_t)0x00010000U)         /* !< Pre-IRQ for Channel 0. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA1_GEN_EVENT_RIS_PREIRQCH0_CLR         ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA1_GEN_EVENT_RIS_PREIRQCH0_SET         ((uint32_t)0x00010000U)         /* !< Set interrupt mask bit */
/* DMA1_GEN_EVENT_RIS[PREIRQCH1] Bits */
#define DMA1_GEN_EVENT_RIS_PREIRQCH1_OFS         (17)                            /* !< PREIRQCH1 Offset */
#define DMA1_GEN_EVENT_RIS_PREIRQCH1_MASK        ((uint32_t)0x00020000U)         /* !< Pre-IRQ for Channel 1. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA1_GEN_EVENT_RIS_PREIRQCH1_CLR         ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA1_GEN_EVENT_RIS_PREIRQCH1_SET         ((uint32_t)0x00020000U)         /* !< Set interrupt mask bit */
/* DMA1_GEN_EVENT_RIS[PREIRQCH2] Bits */
#define DMA1_GEN_EVENT_RIS_PREIRQCH2_OFS         (18)                            /* !< PREIRQCH2 Offset */
#define DMA1_GEN_EVENT_RIS_PREIRQCH2_MASK        ((uint32_t)0x00040000U)         /* !< Pre-IRQ for Channel 2. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA1_GEN_EVENT_RIS_PREIRQCH2_CLR         ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA1_GEN_EVENT_RIS_PREIRQCH2_SET         ((uint32_t)0x00040000U)         /* !< Set interrupt mask bit */
/* DMA1_GEN_EVENT_RIS[PREIRQCH3] Bits */
#define DMA1_GEN_EVENT_RIS_PREIRQCH3_OFS         (19)                            /* !< PREIRQCH3 Offset */
#define DMA1_GEN_EVENT_RIS_PREIRQCH3_MASK        ((uint32_t)0x00080000U)         /* !< Pre-IRQ for Channel 3. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA1_GEN_EVENT_RIS_PREIRQCH3_CLR         ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA1_GEN_EVENT_RIS_PREIRQCH3_SET         ((uint32_t)0x00080000U)         /* !< Set interrupt mask bit */
/* DMA1_GEN_EVENT_RIS[PREIRQCH4] Bits */
#define DMA1_GEN_EVENT_RIS_PREIRQCH4_OFS         (20)                            /* !< PREIRQCH4 Offset */
#define DMA1_GEN_EVENT_RIS_PREIRQCH4_MASK        ((uint32_t)0x00100000U)         /* !< Pre-IRQ for Channel 4. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA1_GEN_EVENT_RIS_PREIRQCH4_CLR         ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA1_GEN_EVENT_RIS_PREIRQCH4_SET         ((uint32_t)0x00100000U)         /* !< Set interrupt mask bit */
/* DMA1_GEN_EVENT_RIS[PREIRQCH5] Bits */
#define DMA1_GEN_EVENT_RIS_PREIRQCH5_OFS         (21)                            /* !< PREIRQCH5 Offset */
#define DMA1_GEN_EVENT_RIS_PREIRQCH5_MASK        ((uint32_t)0x00200000U)         /* !< Pre-IRQ for Channel 5. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA1_GEN_EVENT_RIS_PREIRQCH5_CLR         ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA1_GEN_EVENT_RIS_PREIRQCH5_SET         ((uint32_t)0x00200000U)         /* !< Set interrupt mask bit */
/* DMA1_GEN_EVENT_RIS[ADDRERR] Bits */
#define DMA1_GEN_EVENT_RIS_ADDRERR_OFS           (24)                            /* !< ADDRERR Offset */
#define DMA1_GEN_EVENT_RIS_ADDRERR_MASK          ((uint32_t)0x01000000U)         /* !< DMA address error, SRC address not
                                                                                    reachable. */
#define DMA1_GEN_EVENT_RIS_ADDRERR_CLR           ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA1_GEN_EVENT_RIS_ADDRERR_SET           ((uint32_t)0x01000000U)         /* !< Set interrupt mask bit */
/* DMA1_GEN_EVENT_RIS[DATAERR] Bits */
#define DMA1_GEN_EVENT_RIS_DATAERR_OFS           (25)                            /* !< DATAERR Offset */
#define DMA1_GEN_EVENT_RIS_DATAERR_MASK          ((uint32_t)0x02000000U)         /* !< DMA data error, SRC data might be
                                                                                    corrupted (PAR or ECC error). */
#define DMA1_GEN_EVENT_RIS_DATAERR_CLR           ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA1_GEN_EVENT_RIS_DATAERR_SET           ((uint32_t)0x02000000U)         /* !< Set interrupt mask bit */

