TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_dma1.h
/* DMA1_FPUB_1 Bits */
/* DMA1_FPUB_1[CHANID] Bits */
#define DMA1_FPUB_1_CHANID_OFS                   (0)                             /* !< CHANID Offset */
#define DMA1_FPUB_1_CHANID_MASK                  ((uint32_t)0x000001FFU)         /* !< 0 = disconnected. 1-255 = connected
                                                                                    to channelID = CHANID. */
#define DMA1_FPUB_1_CHANID_MNIMUM                ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define DMA1_FPUB_1_CHANID_UNCONNECTED           ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define DMA1_FPUB_1_CHANID_MAXIMUM               ((uint32_t)0x000000FFU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 255. */

/* DMA1_PDBGCTL Bits */
/* DMA1_PDBGCTL[FREE] Bits */
#define DMA1_PDBGCTL_FREE_OFS                    (0)                             /* !< FREE Offset */
#define DMA1_PDBGCTL_FREE_MASK                   ((uint32_t)0x00000001U)         /* !< Free run control */
#define DMA1_PDBGCTL_FREE_STOP                   ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define DMA1_PDBGCTL_FREE_RUN                    ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */
/* DMA1_PDBGCTL[SOFT] Bits */
#define DMA1_PDBGCTL_SOFT_OFS                    (1)                             /* !< SOFT Offset */
#define DMA1_PDBGCTL_SOFT_MASK                   ((uint32_t)0x00000002U)         /* !< Soft halt boundary control. This
                                                                                    function is only available, if [FREE]
                                                                                    is set to 'STOP' */
#define DMA1_PDBGCTL_SOFT_IMMEDIATE              ((uint32_t)0x00000000U)         /* !< The peripheral will halt
                                                                                    immediately, even if the resultant
                                                                                    state will result in corruption if
                                                                                    the system is restarted */
#define DMA1_PDBGCTL_SOFT_DELAYED                ((uint32_t)0x00000002U)         /* !< The peripheral blocks the debug
                                                                                    freeze until it has reached a
                                                                                    boundary where it can resume without
                                                                                    corruption */

/* DMA1_EVT_MODE Bits */
/* DMA1_EVT_MODE[INT0_CFG] Bits */
#define DMA1_EVT_MODE_INT0_CFG_OFS               (0)                             /* !< INT0_CFG Offset */
#define DMA1_EVT_MODE_INT0_CFG_MASK              ((uint32_t)0x00000003U)         /* !< Event line mode select for event
                                                                                    corresponding to interrupt event
                                                                                    CPU_INT */
#define DMA1_EVT_MODE_INT0_CFG_DISABLE           ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define DMA1_EVT_MODE_INT0_CFG_SOFTWARE          ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define DMA1_EVT_MODE_INT0_CFG_HARDWARE          ((uint32_t)0x00000002U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */
/* DMA1_EVT_MODE[EVT1_CFG] Bits */
#define DMA1_EVT_MODE_EVT1_CFG_OFS               (2)                             /* !< EVT1_CFG Offset */
#define DMA1_EVT_MODE_EVT1_CFG_MASK              ((uint32_t)0x0000000CU)         /* !< Event line mode select for event
                                                                                    corresponding to generic event
                                                                                    GEN_EVENT */
#define DMA1_EVT_MODE_EVT1_CFG_DISABLE           ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define DMA1_EVT_MODE_EVT1_CFG_SOFTWARE          ((uint32_t)0x00000004U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define DMA1_EVT_MODE_EVT1_CFG_HARDWARE          ((uint32_t)0x00000008U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */

/* DMA1_DESC Bits */
/* DMA1_DESC[MINREV] Bits */
#define DMA1_DESC_MINREV_OFS                     (0)                             /* !< MINREV Offset */
#define DMA1_DESC_MINREV_MASK                    ((uint32_t)0x0000000FU)         /* !< Minor rev of the IP */
#define DMA1_DESC_MINREV_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define DMA1_DESC_MINREV_MAXIMUM                 ((uint32_t)0x0000000FU)         /* !< Highest possible value */
/* DMA1_DESC[MAJREV] Bits */
#define DMA1_DESC_MAJREV_OFS                     (4)                             /* !< MAJREV Offset */
#define DMA1_DESC_MAJREV_MASK                    ((uint32_t)0x000000F0U)         /* !< Major rev of the IP */
#define DMA1_DESC_MAJREV_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define DMA1_DESC_MAJREV_MAXIMUM                 ((uint32_t)0x000000F0U)         /* !< Highest possible value */
/* DMA1_DESC[FEATUREVER] Bits */
#define DMA1_DESC_FEATUREVER_OFS                 (12)                            /* !< FEATUREVER Offset */
#define DMA1_DESC_FEATUREVER_MASK                ((uint32_t)0x0000F000U)         /* !< Feature Set for the DMA: number of
                                                                                    DMA channel minus one  (e.g. 0->1ch,
                                                                                    2->3ch, 15->16ch). */
#define DMA1_DESC_FEATUREVER_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value (1 channel) */
#define DMA1_DESC_FEATUREVER_MAXIMUM             ((uint32_t)0x0000F000U)         /* !< Highest value (16 channel) */
/* DMA1_DESC[MODULEID] Bits */
#define DMA1_DESC_MODULEID_OFS                   (16)                            /* !< MODULEID Offset */
#define DMA1_DESC_MODULEID_MASK                  ((uint32_t)0xFFFF0000U)         /* !< Module identification contains a
                                                                                    unique peripheral identification
                                                                                    number. The assignments are
                                                                                    maintained in a central database for
                                                                                    all of the platform modules to ensure
                                                                                    uniqueness. */
#define DMA1_DESC_MODULEID_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define DMA1_DESC_MODULEID_MAXIMUM               ((uint32_t)0xFFFF0000U)         /* !< Highest possible value */

/* DMA1_DMAPRIO Bits */
/* DMA1_DMAPRIO[ROUNDROBIN] Bits */
#define DMA1_DMAPRIO_ROUNDROBIN_OFS              (0)                             /* !< ROUNDROBIN Offset */
#define DMA1_DMAPRIO_ROUNDROBIN_MASK             ((uint32_t)0x00000001U)         /* !< Round robin. This bit enables the
                                                                                    round-robin DMA channel priorities. */
#define DMA1_DMAPRIO_ROUNDROBIN_DISABLE          ((uint32_t)0x00000000U)         /* !< Roundrobin priority disabled, DMA
                                                                                    channel priority is fixed:
                                                                                    DMA0-DMA1-DMA2-...-DMA16 */
#define DMA1_DMAPRIO_ROUNDROBIN_ENABLE           ((uint32_t)0x00000001U)         /* !< Roundrobin priority enabled, DMA
                                                                                    channel priority changes with each
                                                                                    transfer */
/* DMA1_DMAPRIO[BURSTSZ] Bits */
#define DMA1_DMAPRIO_BURSTSZ_OFS                 (16)                            /* !< BURSTSZ Offset */
#define DMA1_DMAPRIO_BURSTSZ_MASK                ((uint32_t)0x00030000U)         /* !< Define the burst size of a block
                                                                                    transfer, before the priority is
                                                                                    re-evaluated */
#define DMA1_DMAPRIO_BURSTSZ_INFINITI            ((uint32_t)0x00000000U)         /* !< There is no burst size, the whole
                                                                                    block transfer is completed on one
                                                                                    transfer without interruption */
#define DMA1_DMAPRIO_BURSTSZ_BURST_8             ((uint32_t)0x00010000U)         /* !< The burst size is 8, after 9
                                                                                    transfers the block transfer is
                                                                                    interrupted and the priority is
                                                                                    reevaluated */
#define DMA1_DMAPRIO_BURSTSZ_BUSRT_16            ((uint32_t)0x00020000U)         /* !< The burst size is 16, after 17
                                                                                    transfers the block transfer is
                                                                                    interrupted and the priority is
                                                                                    reevaluated */
#define DMA1_DMAPRIO_BURSTSZ_BURST_32            ((uint32_t)0x00030000U)         /* !< The burst size is 32, after 33
                                                                                    transfers the block transfer is
                                                                                    interrupted and the priority is
                                                                                    reevaluated */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_dma1__include */

